RT-Thread/rt-thread/bsp/freescale/platform/devices/MK24F12/include/MK24F12_extension.h
/*******************************************************************************
 * FTFE_FCCOB5 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB5 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB5 register
 */
/*@{*/
#define FTFE_RD_FCCOB5(base)     (FTFE_FCCOB5_REG(base))
#define FTFE_WR_FCCOB5(base, value) (FTFE_FCCOB5_REG(base) = (value))
#define FTFE_RMW_FCCOB5(base, mask, value) (FTFE_WR_FCCOB5(base, (FTFE_RD_FCCOB5(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB5(base, value) (FTFE_WR_FCCOB5(base, FTFE_RD_FCCOB5(base) |  (value)))
#define FTFE_CLR_FCCOB5(base, value) (FTFE_WR_FCCOB5(base, FTFE_RD_FCCOB5(base) & ~(value)))
#define FTFE_TOG_FCCOB5(base, value) (FTFE_WR_FCCOB5(base, FTFE_RD_FCCOB5(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB4 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB4 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB4 register
 */
/*@{*/
#define FTFE_RD_FCCOB4(base)     (FTFE_FCCOB4_REG(base))
#define FTFE_WR_FCCOB4(base, value) (FTFE_FCCOB4_REG(base) = (value))
#define FTFE_RMW_FCCOB4(base, mask, value) (FTFE_WR_FCCOB4(base, (FTFE_RD_FCCOB4(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB4(base, value) (FTFE_WR_FCCOB4(base, FTFE_RD_FCCOB4(base) |  (value)))
#define FTFE_CLR_FCCOB4(base, value) (FTFE_WR_FCCOB4(base, FTFE_RD_FCCOB4(base) & ~(value)))
#define FTFE_TOG_FCCOB4(base, value) (FTFE_WR_FCCOB4(base, FTFE_RD_FCCOB4(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOBB - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOBB - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOBB register
 */
/*@{*/
#define FTFE_RD_FCCOBB(base)     (FTFE_FCCOBB_REG(base))
#define FTFE_WR_FCCOBB(base, value) (FTFE_FCCOBB_REG(base) = (value))
#define FTFE_RMW_FCCOBB(base, mask, value) (FTFE_WR_FCCOBB(base, (FTFE_RD_FCCOBB(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOBB(base, value) (FTFE_WR_FCCOBB(base, FTFE_RD_FCCOBB(base) |  (value)))
#define FTFE_CLR_FCCOBB(base, value) (FTFE_WR_FCCOBB(base, FTFE_RD_FCCOBB(base) & ~(value)))
#define FTFE_TOG_FCCOBB(base, value) (FTFE_WR_FCCOBB(base, FTFE_RD_FCCOBB(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOBA - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOBA - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOBA register
 */
/*@{*/
#define FTFE_RD_FCCOBA(base)     (FTFE_FCCOBA_REG(base))
#define FTFE_WR_FCCOBA(base, value) (FTFE_FCCOBA_REG(base) = (value))
#define FTFE_RMW_FCCOBA(base, mask, value) (FTFE_WR_FCCOBA(base, (FTFE_RD_FCCOBA(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOBA(base, value) (FTFE_WR_FCCOBA(base, FTFE_RD_FCCOBA(base) |  (value)))
#define FTFE_CLR_FCCOBA(base, value) (FTFE_WR_FCCOBA(base, FTFE_RD_FCCOBA(base) & ~(value)))
#define FTFE_TOG_FCCOBA(base, value) (FTFE_WR_FCCOBA(base, FTFE_RD_FCCOBA(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB9 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB9 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB9 register
 */
/*@{*/
#define FTFE_RD_FCCOB9(base)     (FTFE_FCCOB9_REG(base))
#define FTFE_WR_FCCOB9(base, value) (FTFE_FCCOB9_REG(base) = (value))
#define FTFE_RMW_FCCOB9(base, mask, value) (FTFE_WR_FCCOB9(base, (FTFE_RD_FCCOB9(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB9(base, value) (FTFE_WR_FCCOB9(base, FTFE_RD_FCCOB9(base) |  (value)))
#define FTFE_CLR_FCCOB9(base, value) (FTFE_WR_FCCOB9(base, FTFE_RD_FCCOB9(base) & ~(value)))
#define FTFE_TOG_FCCOB9(base, value) (FTFE_WR_FCCOB9(base, FTFE_RD_FCCOB9(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * FTFE_FCCOB8 - Flash Common Command Object Registers
 ******************************************************************************/

/*!
 * @brief FTFE_FCCOB8 - Flash Common Command Object Registers (RW)
 *
 * Reset value: 0x00U
 *
 * The FCCOB register group provides 12 bytes for command codes and parameters.
 * The individual bytes within the set append a 0-B hex identifier to the FCCOB
 * register name: FCCOB0, FCCOB1, ..., FCCOBB.
 */
/*!
 * @name Constants and macros for entire FTFE_FCCOB8 register
 */
/*@{*/
#define FTFE_RD_FCCOB8(base)     (FTFE_FCCOB8_REG(base))
#define FTFE_WR_FCCOB8(base, value) (FTFE_FCCOB8_REG(base) = (value))
#define FTFE_RMW_FCCOB8(base, mask, value) (FTFE_WR_FCCOB8(base, (FTFE_RD_FCCOB8(base) & ~(mask)) | (value)))
#define FTFE_SET_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) |  (value)))
#define FTFE_CLR_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) & ~(value)))
#define FTFE_TOG_FCCOB8(base, value) (FTFE_WR_FCCOB8(base, FTFE_RD_FCCOB8(base) ^  (value)))
/*@}*/

